# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)


EndUser.create(
  [
    {
      email: 'a@a',
      password: 'password',
      cooking_time_limit: 120
    },
    {
      email: 'b@b',
      password: 'password'
    }
  ]
)

[
  [1, '水', 0, 5],
  [2, '水', 2, 5],
  [10, 'お米', 5, 0],
  [11, 'うどん', 6, 0],
  [100, '牛肉', 6, 1],
  [101, '豚肉', 6, 1],
  [102, '鶏肉', 6, 1],
  [103, 'ひき肉', 6, 1],
  [500, 'まぐろ', 7, 0],
  [501, '鮭', 7, 2],
  [502, 'スモークサーモン', 7, 2],
  [503, '鱈', 7, 0],
  [504, 'タコ', 9, 1],
  [505, 'カニ', 9, 1],
  [1000, '人参', 9, 2],
  [1001, 'じゃがいも', 8, 0],
  [1002, 'なす', 8, 5],
  [1003, 'キャベツ', 8, 4],
  [1004, 'レタス', 8, 4],
  [1005, 'きゅうり', 9, 3],
  [1006, 'ほうれん草', 6, 3],
  [1007, 'ピーマン', 8, 3],
  [1008, 'はくさい', 8, 4],
  [1009, 'たまねぎ', 10, 0],
  [1010, 'ねぎ', 9, 3],
  [1011, 'れんこん', 8, 0],
  [1012, 'もやし', 6, 0],
  [1013, 'ブロッコリー', 8, 3],
  [1014, 'トマト', 8, 1],
  [1015, 'アボカド', 8, 4],
  [1016, '万能ねぎ', 0, 4],
  [1017, 'オクラ', 8, 3],
  [1018, 'かぼちゃ', 8, 4],
  [3000, 'しめじ', 13, 0],
  [3001, 'しいたけ', 13, 0],
  [3002, 'まいたけ', 13, 0],
  [3003, 'えのき', 13, 0],
  [5000, '塩', 1, 5],
  [5001, '塩', 3, 5],
  [5002, '塩', 4, 5],
  [5003, '胡椒', 1, 5],
  [5004, '胡椒', 3, 5],
  [5005, '胡椒', 4, 5],
  [5006, '砂糖', 1, 5],
  [5007, '砂糖', 3, 5],
  [5008, '砂糖', 4, 5],
  [5009, '味の素', 1, 5],
  [5010, '味の素', 3, 5],
  [5012, '味の素', 4, 5],
  [5013, '醤油', 3, 5],
  [5014, '醤油', 4, 5],
  [5015, 'みりん', 3, 5],
  [5016, 'みりん', 4, 5],
  [5017, '酒', 3, 5],
  [5018, '酒', 4, 5],
  [5019, 'サラダ油', 2, 5],
  [5020, 'サラダ油', 3, 5],
  [5021, 'サラダ油', 4, 5],
  [5022, 'オリーブオイル', 2, 5],
  [5023, 'オリーブオイル', 3, 5],
  [5024, 'オリーブオイル', 4, 5],
  [5025, 'ごま油', 2, 5],
  [5026, 'ごま油', 3, 5],
  [5027, 'ごま油', 4, 5]
].each do |code, name, unit, html_color|
  Ingredient.create(code: code, name: name, unit: unit, html_color: html_color)
end
